src/sw-latex.org
#+TITLE: Latex - A document preparation system

* 介绍
高质量排版系统. 基于TeX引擎.

* 安装
- 下载: [[https://www.tug.org/texlive/acquire-iso.html][点击下载]]DVD, 中国区选择[[https://mirrors.tuna.tsinghua.edu.cn/CTAN/systems/texlive/Images/][清华大学镜像]].
- 挂载: ~mount -o ro,loop,noauto /your/texlive.iso ~/mnt~
- 安装: ~cd mnt; sudo ./install-tl~
- 配置: 添加路径/usr/local/texlive/2017/bin/x86_64-linux到/etc/profile或
适当的路径配置文件
- Win系统: 执行 ~install-tl-windows.bat~ 安装.
- 参考: [[https://www.tug.org/texlive/quickinstall.html]]

* 链接
- 主页: [[https://www.latex-project.org/]]
