sw-latex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-05 Sat 14:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Latex - A document preparation system</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="U-HOME\yanyg" />
<link rel="shortcut icon" href="http://ycode.org/css/favicon.ico" />
<link rel="stylesheet" type="text/css" href="css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Latex - A document preparation system</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6aa2fdc">1. 介绍</a></li>
<li><a href="#org5b9e8ac">2. 安装</a></li>
<li><a href="#org190aa42">3. 链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6aa2fdc" class="outline-2">
<h2 id="org6aa2fdc"><span class="section-number-2">1</span> 介绍</h2>
<div class="outline-text-2" id="text-1">
<p>
高质量排版系统. 基于TeX引擎.
</p>
</div>
</div>

<div id="outline-container-org5b9e8ac" class="outline-2">
<h2 id="org5b9e8ac"><span class="section-number-2">2</span> 安装</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>下载: <a href="https://www.tug.org/texlive/acquire-iso.html">点击下载</a>DVD, 中国区选择<a href="https://mirrors.tuna.tsinghua.edu.cn/CTAN/systems/texlive/Images/">清华大学镜像</a>.</li>
<li>挂载: <code>mount -o ro,loop,noauto /your/texlive.iso ~/mnt</code></li>
<li>安装: <code>cd mnt; sudo ./install-tl</code></li>
<li>配置: 添加路径/usr/local/texlive/2017/bin/x86_64-linux到/etc/profile或</li>
</ul>
<p>
适当的路径配置文件
</p>
<ul class="org-ul">
<li>Win系统: 执行 <code>install-tl-windows.bat</code> 安装.</li>
<li>参考: <a href="https://www.tug.org/texlive/quickinstall.html">https://www.tug.org/texlive/quickinstall.html</a></li>
</ul>
</div>
</div>

<div id="outline-container-org190aa42" class="outline-2">
<h2 id="org190aa42"><span class="section-number-2">3</span> 链接</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>主页: <a href="https://www.latex-project.org/">https://www.latex-project.org/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2017-08-05 Sat 13:33. Created by U-HOME\yanyg</p> <div id="disqus_thread"></div> <script type="text/javascript"> var disqus_shortname = 'yanyg'; (function() {  var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;  dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';  (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);  })(); </script>
</div>
</body>
</html>
